Transmitter.Tests/src/InformationRegisters/ВнешниеЗапросы/ВнешниеЗапросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0f493aac-a55c-4297-b77f-b63ab42dc37e">
  <name>ВнешниеЗапросы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="4773d106-7e31-4ba1-8475-b868984cedf4">
    <name>Data</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes extendedConfigurationObject="4a606aac-354d-403b-acec-f6d099ce300a">
    <name>Сообщение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions extendedConfigurationObject="c9166ddb-3b90-4103-a795-5b301304f6d4">
    <name>Обработчик</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ОбработчикиВнешнихЗапросов</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="228bede1-2c6c-4420-9c89-db095fa86a11">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.ИдентификаторКоммита</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Transmitter.Tests/src/CommonModules/РС_ВнешниеФайлы_ММ/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

	//@skip-check undefined-variable
	ЮТТесты
		.ВТранзакции()
			.ДобавитьТест("ЗаписатьДанные")
				.Перед("ОчиститьРегистр")
			.ДобавитьТест("НайтиДанные")
				.СПараметрами(ПолучитьДвоичныеДанныеИзСтроки("что-то"))
				.СПараметрами(123)
			.ДобавитьТест("НайтиДанныеВозвращаетНеопределеноЕслиПараметрыНеопределены")
	;
	
КонецПроцедуры

// TODO в YaxUnit не работают моки из фоновых, поэтому пока такое решение. После исправления ошибки
// можно будет убрать и добавить мок для методов Сохранить при создании объектов в фоне.
Процедура ОчиститьРегистр() Экспорт
	
	НаборЗаписей = РегистрыСведений.ВнешниеФайлы.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьДанные() Экспорт
	
	// given
	ФэйковыйОбработчик = ОМ_ТестовыеДанные.ПолучитьФейковыйОбработчик();
	
	Идентификатор = ОМ_ТестовыеДанные.ПолучитьИдентификаторКоммита();
	Данные = ОМ_ТестовыеДанные.ПолучитьФейковыйJSON();
	
	// when
	РегистрыСведений.ВнешниеФайлы.ЗаписатьДанные(ФэйковыйОбработчик, Идентификатор, Данные);
	
	// then
	ОМ_Тесты.ЮТест()
		.ОжидаетЧтоТаблицаБазы("РегистрСведений.ВнешниеФайлы")
			.СодержитЗаписи();
	
	Записи = ОМ_Тесты.ЮТЗапросы().Записи("РегистрСведений.ВнешниеФайлы", Неопределено);
	ОМ_Тесты.ЮТест().ОжидаетЧто(Записи)
		.ИмеетДлину(1)
		.Свойство("[0].Обработчик").Равно(ФэйковыйОбработчик)
		.Свойство("[0].Идентификатор").Равно(Идентификатор)
		.Свойство("[0].Data").ИмеетТип(Тип("ХранилищеЗначения"))
		.Свойство("[0].Data").Равно(Новый ХранилищеЗначения(Данные));
	
КонецПроцедуры

Процедура НайтиДанные(Знач Данные) Экспорт
	
	// given
	ФэйковыйОбработчик = ОМ_ТестовыеДанные.ПолучитьФейковыйОбработчик();
	
	Идентификатор = ОМ_ТестовыеДанные.ПолучитьИдентификаторКоммита();
	
	Запись = РегистрыСведений.ВнешниеЗапросы.СоздатьМенеджерЗаписи();
	Запись.Обработчик = ФэйковыйОбработчик;
	Запись.Идентификатор = Идентификатор;
	Запись.Data = Новый ХранилищеЗначения(Данные);
	Запись.Записать();	
	
	// when
	Результат = РегистрыСведений.ВнешниеЗапросы.НайтиДанные(ФэйковыйОбработчик, Идентификатор);
	
	// then
	ОМ_Тесты.ЮТест()
		.ОжидаетЧто(Результат)
			.Равно(Данные);	
	
КонецПроцедуры

Процедура НайтиДанныеВозвращаетНеопределеноЕслиПараметрыНеопределены() Экспорт
	
	// given
	
	// when
	Результат = РегистрыСведений.ВнешниеЗапросы.НайтиДанные(Неопределено, Неопределено);
	
	// then
	ОМ_Тесты.ЮТест()
		.ОжидаетЧто(Результат)
			.ЭтоНеопределено();	
	
КонецПроцедуры

#КонецОбласти
